# -*- org-export-with-todo-keywords: nil; org-export-use-babel: t; org-edit-src-content-indentation: 2; org-src-preserve-indentation: nil; org-babel-results-keyword: "results"; org-image-actual-width: 1100; org-make-toc-insert-custom-ids: t; org-pandoc-format-extensions: (markdown_github+pipe_tables+raw_html); -*-
#+PROPERTY: HEADER-ARGS                 :eval never-export
#+PROPERTY: HEADER-ARGS:shell           :shebang /bin/bash :prologue "echo '# OUTPUT:'"
#+PROPERTY: HEADER-ARGS:jupyter-python  :session 20241230--02--5ghz--with_load
#+EXPORT_FILE_NAME: README
#+OPTIONS: toc:nil
#+OPTIONS: tags:nil

* SECTION Test summary                                              :noipynb:
  :PROPERTIES:
  :CUSTOM_ID: test-summary
  :END:

*Test group:* =20250210_gh712_peak_jitter= Testing peak jitter calculation.

*Test:* =02--5ghz--with_load= 5GHz Wi-Fi link, simulated network load.

*Date:*

#+begin_src shell :results drawer :exports results :prologue ""
  date "+%a %d %b %Y"
#+end_src

#+results:
:results:
Sat 15 Feb 2025
:end:

*Artifacts:*

| *name*        | *link*            |
|---------------+-------------------|
| receiver dump | [[file:roc_recv.csv.xz][=roc_recv.csv.xz=]] |
| receiver log  | [[file:roc_recv.log.xz][=roc_recv.log.xz=]] |
| sender log    | [[file:roc_send.log.xz][=roc_send.log.xz=]] |
| iperf log     | [[file:iperf3.log.xz][=iperf3.log.xz=]]   |

*Jupyter notebook:*

[[file:README.ipynb][=README.ipynb=]]

** Software info

- *git revisions*

   #+begin_src shell :results verbatim :exports both :dir ~/dev/roc-streaming
     cd roc-toolkit && git log -1 --format=short
   #+end_src

   #+results:
   : # OUTPUT:
   : commit 62100a71dc06c20b94304110e6d228083fdd8125
   : Author: Victor Gaydov <victor@enise.org>
   :
   :     chore: Use nanoseconds for all jitter entries in dump

   #+begin_src shell :results verbatim :exports both :dir ~/dev/roc-streaming
     cd csvplotter && git log -1 --format=short
   #+end_src

   #+results:
   : # OUTPUT:
   : commit e8afcd190cda52198cc13a89cad7479e2ae5bba6
   : Author: Victor Gaydov <victor@enise.org>
   :
   :     "Decimation"

- *roc-toolkit version*

   #+begin_src shell :results verbatim :exports both
     roc-recv --version
   #+end_src

   #+results:
   : # OUTPUT:
   : roc-recv 0.4.0 (62100a71dc)

   #+begin_src shell :results verbatim :exports both
     ssh orangepi-lite2.lan ./roc/roc-send --version
   #+end_src

   #+results:
   : # OUTPUT:
   : roc-send 0.4.0 (62100a71dc)

- *iperf version*

   #+begin_src shell :results verbatim :exports both
     iperf3 --version
   #+end_src

   #+results:
   : # OUTPUT:
   : iperf 3.12 (cJSON 1.7.15)
   : Linux dell-xps15 6.1.0-28-amd64 #1 SMP PREEMPT_DYNAMIC Debian 6.1.119-1 (2024-11-22) x86_64
   : Optional features available: CPU affinity setting, IPv6 flow label, SCTP, TCP congestion algorithm setting, sendfile / zerocopy, socket pacing, authentication, bind to device, support IPv4 don't fragment

   #+begin_src shell :results verbatim :exports both
     ssh orangepi-lite2.lan iperf3 --version
   #+end_src

   #+results:
   : # OUTPUT:
   : Linux opi-l2 3.10.65 #5 SMP PREEMPT Sat Mar 10 14:57:32 CST 2018 aarch64 aarch64 aarch64 GNU/Linux
   : iperf 3.0.11

** Precheck

- *iwconfig*

   #+begin_src shell :results verbatim :exports both
     sudo iwconfig wlp0s20f3
   #+end_src

   #+results:
   #+begin_example
   # OUTPUT:
   wlp0s20f3  IEEE 802.11  ESSID:"blackmesa5a"
             Mode:Managed  Frequency:5.18 GHz  Access Point: 2C:C8:1B:21:5C:1D
             Bit Rate=866.7 Mb/s   Tx-Power=22 dBm
             Retry short limit:7   RTS thr:off   Fragment thr:off
             Encryption key:off
             Power Management:on
             Link Quality=70/70  Signal level=-36 dBm
             Rx invalid nwid:0  Rx invalid crypt:0  Rx invalid frag:0
             Tx excessive retries:0  Invalid misc:204   Missed beacon:0

   #+end_example

   #+begin_src shell :results verbatim :exports both
     ssh orangepi-lite2.lan sudo iwconfig wlan0
   #+end_src

   #+results:
   #+begin_example
   # OUTPUT:
   wlan0     IEEE 802.11  ESSID:"blackmesa5a"
             Mode:Master  Channel:42  Access Point: 2C:C8:1B:21:5C:1D
             Bit Rate=433 Mb/s   Tx-Power:32 dBm
             Retry min limit:7   RTS thr:off   Fragment thr:off
             Encryption key:off
             Power Managementmode:All packets received
             Link Quality=5/5  Signal level=-49 dBm  Noise level=-95 dBm
             Rx invalid nwid:0  Rx invalid crypt:0  Rx invalid frag:0
             Tx excessive retries:73  Invalid misc:0   Missed beacon:0

   #+end_example

- *ping without load*

   #+begin_src shell :results verbatim :exports both
     ping -q -i 0.002 -c 1000 orangepi-lite2.lan
   #+end_src

   #+results:
   : # OUTPUT:
   : PING orangepi-lite2.lan (192.168.0.140) 56(84) bytes of data.
   :
   : --- orangepi-lite2.lan ping statistics ---
   : 1000 packets transmitted, 1000 received, 0% packet loss, time 9676ms
   : rtt min/avg/max/mdev = 1.494/12.128/228.794/19.158 ms, pipe 23

- *ping with load*

   #+begin_src shell :results verbatim :exports both
     ping -q -i 0.002 -c 1000 orangepi-lite2.lan
   #+end_src

   #+results:
   : # OUTPUT:
   : PING orangepi-lite2.lan (192.168.0.140) 56(84) bytes of data.
   :
   : --- orangepi-lite2.lan ping statistics ---
   : 1000 packets transmitted, 985 received, 1.5% packet loss, time 8978ms
   : rtt min/avg/max/mdev = 1.613/17.121/309.525/33.588 ms, pipe 31

* SECTION Library code
  :PROPERTIES:
  :CUSTOM_ID: library-code
  :END:

#+begin_export markdown
<details>
  <summary>Click to expand</summary>
#+end_export

#+transclude: [[file:../library.py]]  :src jupyter-python :rest ":results none"

#+begin_export markdown
</details>
#+end_export

#+begin_src jupyter-python :exports both
  data = load_csv('roc_recv.csv')
  data.keys()
#+end_src

#+results:
: dict_keys(['m', 'd', 't', 'f'])

** Statistics

#+begin_src jupyter-python :exports both
  format_tables(stats_table('jitter', data['m'][:,2]/1e6),
                stats_table('peak-jitter', data['m'][:,3]/1e6))
#+end_src

#+results:
|       | *jitter*   | *peak-jitter* |
|-------+------------+---------------|
| *min* | 0.002 ms   | 4.048 ms      |
| *max* | 517.675 ms | 517.671 ms    |
| *avg* | 5.529 ms   | 495.612 ms    |
| *p95* | 5.801 ms   | 517.671 ms    |

** Statistics

#+begin_src jupyter-python :exports both
  format_tables(stats_table('niq-latency', data['t'][:,1]/44100*1e3),
                stats_table('target-latency', data['t'][:,2]/44100*1e3))
#+end_src

#+results:
|       | *niq-latency* | *target-latency* |
|-------+---------------+------------------|
| *min* | -229.683 ms   | 217.687 ms       |
| *max* | 812.426 ms    | 781.156 ms       |
| *avg* | 742.827 ms    | 770.582 ms       |
| *p95* | 797.279 ms    | 781.156 ms       |

